주피터 SQL 엔진 설정

In [ ]:
%load_ext sql

In [ ]:
!pip install SQLAlchemy==1.4.47

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Requirement already satisfied: SQLAlchemy==1.4.47 in /usr/local/lib/python3.10/dist-packages (1.4.47)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from SQLAlchemy==1.4.47) (2.0.2)

In [ ]:
%sql postgresql://***:****@url:5439/dev

In [ ]:
%%sql
-- count컬럼 데이터 검증
SELECT SUM(count) AS total_count
FROM (
  SELECT
    A.deal_year,
    B.gu_name,
    COUNT(B.gu_name) AS count
  FROM raw_data.apartment_sale_info A
  JOIN raw_data.gu_info B ON A.regional_code = B.gu_code
  GROUP BY 1, 2
) subquery;

 * postgresql://admin:***@default.364472264080.us-west-2.redshift-serverless.amazonaws.com:5439/dev
1 rows affected.

[(140287,)]

In [ ]:
%%sql
-- 년도별 구별 실거래수 
CREATE TABLE raw_data.deal_count AS 
SELECT
  A.deal_year,
  B.gu_name,
  COUNT(B.gu_name) as count
FROM raw_data.apartment_sale_info A
JOIN raw_data.gu_info B ON A.regional_code = B.gu_code
GROUP BY 1,2
ORDER BY 1;

 * postgresql://admin:***@default.364472264080.us-west-2.redshift-serverless.amazonaws.com:5439/dev
Done.

[]

In [ ]:
%%sql
-- 구별 실거래가 
CREATE TABLE raw_data.groupby_gu_price AS 
SELECT
  A.deal_year,
  B.gu_name,
  AVG(CAST(REPLACE(A.deal_amount,',','') AS INT)/A.area_for_exclusive_use) AS avg_price
FROM raw_data.apartment_sale_info A
JOIN raw_data.gu_info B ON A.regional_code = B.gu_code
GROUP BY 1, 2
ORDER BY 1;

 * postgresql://admin:***@default.364472264080.us-west-2.redshift-serverless.amazonaws.com:5439/dev
Done.

[]

In [ ]:
%%sql
-- 월별 거래수
CREATE TABLE raw_data.deal_monthly AS 
SELECT
  deal_year,
  deal_month,
  COUNT(A.deal_month) AS deal_count
FROM raw_data.apartment_sale_info A
GROUP BY 1, 2
ORDER BY 1, 2;

 * postgresql://admin:***@default.364472264080.us-west-2.redshift-serverless.amazonaws.com:5439/dev
Done.

[]

In [ ]:
%%sql

select * from raw_data.apartment_sale_info limit 10

 * postgresql://admin:***@default.364472264080.us-west-2.redshift-serverless.amazonaws.com:5439/dev
10 rows affected.

[(3667, '44,500', '', 1993, 2020, '창신동', '창신쌍용2', 1, 18, 54.7, '', '703', '11110', 5, '', ''),
 (16211, '79,500', '', 2008, 2020, '황학동', '롯데캐슬', 1, 8, 84.97, '', '2545', '11140', 18, '', ''),
 (27987, '149,000', '', 1975, 2020, '이촌동', '현대맨숀', 1, 16, 99.13, '', '301-162', '11170', 9, '', ''),
 (29651, '108,000', '', 1994, 2020, '이태원동', '남산대림', 1, 17, 59.92, '', '729', '11170', 1, '', ''),
 (31315, '37,000', '', 1998, 2020, '한남동', '현대안성타워', 1, 23, 38.1, '', '737-28', '11170', 14, '', ''),
 (36307, '56,000', '', 2002, 2020, '마장동', '장원', 1, 16, 84.8, '', '767-1', '11200', 3, '', ''),
 (74195, '55,000', '', 1992, 2020, '전농동', '전농우성', 1, 30, 84.84, '', '6', '11230', 14, '', ''),
 (151891, '50,300', '', 1994, 2020, '보문동6가', '아남', 1, 29, 84.41, '', '36-2', '11290', 6, '', ''),
 (155603, '40,500', '', 2005, 2020, '정릉동', '정릉풍림아이원', 1, 8, 60.0, '', '239', '11290', 13, '', ''),
 (195155, '67,300', '', 2011, 2020, '미아동', '두산위브트레지움', 1, 7, 84.99, '', '811', '11305', 20, '', '')]

In [ ]:
%%sql

insert into raw_data.gu_info values('11740', '강동구');

 * postgresql://admin:***@default.364472264080.us-west-2.redshift-serverless.amazonaws.com:5439/dev
1 rows affected.

[]